bench/scenarios/task-edit.yaml
# Task Edit step-up — looping VUs find the throughput ceiling.
#
# Each VU loops 5 times, cycling through edit types (assignedTo, variant, status, description).
# Steps up: 50 → 100 → 125 arrivals/s (~625 req/s peak).
# Task edits are heavier than attachments (5-6 DB round-trips vs 3).
config:
  target: "http://localhost:4000"
  processor: "../src/processors/task-edit.ts"
  phases:
    - duration: 10
      arrivalRate: 50
      name: "hold 50"
    - duration: 10
      arrivalRate: 100
      name: "hold 100"
    - duration: 15
      arrivalRate: 125
      name: "hold 125"
  plugins:
    ensure:
      maxErrorRate: 1
      thresholds:
        - http.response_time.p95: 3000

scenarios:
  - beforeScenario: "authenticate"
    flow:
      - loop:
          - function: "buildTaskEditPayload"
          - put:
              url: "/{{ tenantId }}/{{ orgId }}/tasks/{{ taskId }}"
              headers:
                Content-Type: "application/json"
                cookie: "{{ cookie }}"
              json: "{{ payload }}"
          - think: "50ms"
        count: 5